/*

使い方
1.ブラウザのJavaScriptコンソールを開く（ChromeならF12を押して開いたウィンドウのConsoleタブ）
2.このファイルを全て選択してコピペしてエンター
3.↓の数値等をいじってコピペしてエンター
4.結果を見る（棒立ち率はその敵が昼砲撃戦で行動しなくなる確率　敵機全滅率は航空戦で0ダメージ確定する確率）

//-----------------------
//ここから

シミュ回数 = 100000; //多いほど正確さが増すが時間がかかる
敵スロット = [ //艦爆・艦攻のスロットだけ書く
    [36, 36, 36],
    [32, 27, 5],
];
制空状況 = [ //基地航空隊を送る場合は複数　送らないなら1つだけ
    "拮抗",
    "拮抗",
    "確保",
];
対空CI = [ //発動率は対空カットイン単体の発動率ではなく、航空戦1回ごとの発動率
    { "発動率": 0.098, "固定": 9, "変動": 1.65 },
    { "発動率": 0.241, "固定": 10, "変動": 1.7 },
    { "発動率": 0.594, "固定": 10, "変動": 1.7 },
    { "発動率": 0.036, "固定": 4, "変動": 1.5 },
];
艦娘 = [ //艦娘の固定撃墜と割合撃墜をセットで記述　6隻以上でも一応計算はするけど連合艦隊は非対応
    { "固定": 26, "割合": 0.41 },
    { "固定": 24, "割合": 0.345 },
    { "固定": 24, "割合": 0.345 },
    { "固定": 41, "割合": 0.78 },
    { "固定": 22, "割合": 0.3 },
    { "固定": 32, "割合": 0.555 },
];
対空シミュ(制空状況, 敵スロット, シミュ回数, 艦娘, 対空CI);

//ここまで
//------------------------

*/


対空シミュ = (制空状況, デフォ敵, シミュ回数, 艦娘, CI) => {
    console.time();
    const 切捨 = a => parseInt(a * 10) / 10;
    const 喪失数 = (a, b) => {
        const r = { 確保: 10, 優勢: 8, 拮抗: 6, 劣勢: 4, 喪失: 1 }[b];
        const p = Math.floor(Math.random() * (r + 1));
        const q = Math.floor(Math.random() * (r + 1));
        return Math.floor(a * (35 * p + 65 * q) / 1000);
    }
    const deepcopy = (a) => {
        if (["number", "string", "undefined", "boolean"].some(b => b === typeof a)) {
            return a;
        } else if (Array.isArray(a)) { //Array
            const ary = [];
            for (let i = 0; i < a.length; i++) {
                ary[i] = deepcopy(a[i]);
            }
            return ary;
        } else if (Object.getPrototypeOf(a) === Map.prototype) { //Map
            const m = new Map();
            for (let [k, v] of a) {
                m.set(k, deepcopy(v));
            }
            return m;
        } else { //Object
            const o = {};
            for (let i in a) {
                o[i] = deepcopy(a[i]);
            }
            return o;
        }
    }
    const 対空CI判定 = (a) => {
        const r = Math.random();
        let s = 0;
        let o = { "固定": 0, "変動": 1 };
        for (let i of a) {
            s += i.発動率;
            if (r < s) {
                o.固定 = i.固定;
                o.変動 = i.変動;
                break;
            }
        }
        return o;
    }

    const 艦娘数 = 艦娘.length;
    const 敵数 = デフォ敵.length;
    let 棒立ち回数 = new Array(敵数);
    for (let i = 0; i < 敵数; i++) 棒立ち回数[i] = 0;
    let 全滅回数 = 0;

    for (let N = 0; N < シミュ回数; N++) {
        let 敵 = deepcopy(デフォ敵);
        let 全滅flg = true;
        const CI結果 = 対空CI判定(CI);
        const 固定ボ = CI結果.固定;
        const 変動ボ = CI結果.変動;

        for (let idx = 0; idx < 敵数; idx++) {
            for (let slotnum = 0; slotnum < 敵[idx].length; slotnum++) {
                //st1
                let temp = 敵[idx][slotnum];
                for (let 制空 of 制空状況) {
                    temp = temp - 喪失数(temp, 制空);
                }

                //st2
                const 対空担当艦 = Math.floor(Math.random() * 艦娘数);
                const 割合 = 艦娘[対空担当艦].割合;
                const 固定 = 艦娘[対空担当艦].固定;

                //st2割合
                if (Math.random() < 0.5) {
                    temp = temp - Math.floor(temp * 割合);
                }

                //st2固定
                if (Math.random() < 0.5) {
                    temp = temp - Math.floor(固定 * 変動ボ);
                }

                //対空CI固定撃墜
                temp = temp - 固定ボ;

                //最低保証
                temp = temp - 1;

                //おわり
                if (temp <= 0) {
                    temp = 0;
                } else {
                    全滅flg = false;
                }
                敵[idx][slotnum] = temp;
            }
            if (敵[idx].every(a => a === 0)) 棒立ち回数[idx]++;
        }
        if (全滅flg) 全滅回数++;
    }
    console.timeEnd();
    let out = "";
    for (let i = 0; i < 敵数; i++) {
        out += `${i + 1}番目の敵の棒立ち率：${切捨(棒立ち回数[i] / シミュ回数 * 100)}%  `;
    }
    out += `敵機全滅率: ${切捨(全滅回数 / シミュ回数 * 100)}%`
    return out;
};



/*6-5-C下上
https://jervis.page.link/4P6N
https://twitter.com/DarkQuetzal/status/1223429619853840384

シミュ回数 = 1000000;
敵スロット = [[36, 36, 36]];
制空状況 = ["拮抗", "拮抗", "確保"];
対空CI = [
    { "発動率": 0.098, "固定": 9, "変動": 1.65 },
    { "発動率": 0.241, "固定": 10, "変動": 1.7 },
    { "発動率": 0.594, "固定": 10, "変動": 1.7 },
    { "発動率": 0.036, "固定": 4, "変動": 1.5 },
];
艦娘 = [
    { "固定": 26, "割合": 0.41 },
    { "固定": 24, "割合": 0.345 },
    { "固定": 24, "割合": 0.345 },
    { "固定": 41, "割合": 0.78 },
    { "固定": 22, "割合": 0.3 },
    { "固定": 32, "割合": 0.555 },
];
対空シミュ(制空状況, 敵スロット, シミュ回数, 艦娘, 対空CI);
*/


/*テスト用

シミュ回数 = 10000;
敵スロット = [[10],[10,10],[1]];
制空状況 = ["喪失"];
対空CI = [
    { "発動率": 0.5, "固定": 100, "変動": 1 },
    { "発動率": 0.4, "固定": 100, "変動": 1 },
];
艦娘 = [
    { "固定": 100, "割合": 1 },
];
対空シミュ(制空状況, 敵スロット, シミュ回数, 艦娘, 対空CI);
*/


/* 5-2-C 制空確保Atlanta入りレベリング　編成: https://jervis.page.link/itEH

シミュ回数 = 10000;
敵スロット = [[32,27,5],[32,27,5]];
制空状況 = ["確保"];
対空CI = [
    { "発動率": 0.098, "固定": 9, "変動": 1.65 },
    { "発動率": 0.241, "固定": 10, "変動": 1.7 },
    { "発動率": 0.594, "固定": 10, "変動": 1.7 },
    { "発動率": 0.036, "固定": 4, "変動": 1.5 },
];
艦娘 = [
    { "固定": 36, "割合": 0.46 },
    { "固定": 50, "割合": 0.79 },
    { "固定": 33, "割合": 0.38 },
    { "固定": 33, "割合": 0.38 },
    { "固定": 35, "割合": 0.43 },
    { "固定": 41, "割合": 0.58 },
];
対空シミュ(制空状況, 敵スロット, シミュ回数, 艦娘, 対空CI);
*/
